<a href="https://colab.research.google.com/github/ahmadajal/BigDataCourse/blob/master/week2/SQL_Assignment_sol.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Assignment - SQL

In [1]:
%load_ext sql
import pandas as pd
%sql sqlite://

'Connected: @None'

### <font color = 'green'>World Cup Data</font>

In [0]:
# Load tables from CSV files
# Players
with open('Players.csv','rU') as f:
    Players = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Players;
%sql persist Players
# Teams
with open('Teams.csv','rU') as f:
    Teams = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Teams;
%sql persist Teams
# join Teams and Players
with open('PlayersExt.csv','rU') as f:
    PlayersExt = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists PlayersExt;
%sql persist PlayersExt

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

/Applications/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:3: DeprecationWarning: 'U' mode is deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
/Applications/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:8: DeprecationWarning: 'U' mode is deprecated

/Applications/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:13: DeprecationWarning: 'U' mode is deprecated
  del sys.path[0]

'Persisted playersext'

#### Look at sample of Players and Teams tables

In [0]:
%%sql
select * from Players limit 5

 * sqlite://
Done.

[('Abdoun', 'Algeria', 'midfielder', 16, 0, 6, 0, 0),
 ('Belhadj', 'Algeria', 'defender', 270, 1, 146, 8, 0),
 ('Boudebouz', 'Algeria', 'midfielder', 74, 3, 28, 1, 0),
 ('Bougherra', 'Algeria', 'defender', 270, 1, 89, 11, 0),
 ('Chaouchi', 'Algeria', 'goalkeeper', 90, 0, 17, 0, 2)]

In [0]:
%%sql
select * from Teams limit 5

 * sqlite://
Done.

[('Brazil', 1, 5, 3, 1, 1, 9, 4, 7, 2),
 ('Spain', 2, 6, 5, 0, 1, 7, 2, 3, 0),
 ('Portugal', 3, 4, 1, 2, 1, 7, 1, 8, 1),
 ('Netherlands', 4, 6, 6, 0, 0, 12, 5, 15, 0),
 ('Italy', 5, 3, 0, 2, 1, 4, 5, 5, 0)]

In [0]:
%%sql
select * from PlayersExt limit 5

 * sqlite://
Done.

[('Abdoun', 'Algeria', 30, 3, 0, 1, 2, 0, 2, 4, 2, 'midfielder', 16, 0, 6, 0, 0),
 ('Belhadj', 'Algeria', 30, 3, 0, 1, 2, 0, 2, 4, 2, 'defender', 270, 1, 146, 8, 0),
 ('Boudebouz', 'Algeria', 30, 3, 0, 1, 2, 0, 2, 4, 2, 'midfielder', 74, 3, 28, 1, 0),
 ('Bougherra', 'Algeria', 30, 3, 0, 1, 2, 0, 2, 4, 2, 'defender', 270, 1, 89, 11, 0),
 ('Chaouchi', 'Algeria', 30, 3, 0, 1, 2, 0, 2, 4, 2, 'goalkeeper', 90, 0, 17, 0, 2)]

#### <font color = 'green'>World Cup Basic Queries</font>

*1)  What player on a team with “ia” in the team name played less than 200 minutes and made more than 100 passes? Return the player surname and team. *

__Hint: To check if attribute A contains string S use "A like '%S%'" __

In [0]:
%%sql
select surname, team from Players where Players.team like '%ia%' AND Players.minutes < 200 
AND Players.passes > 100

 * sqlite://
Done.

[('Kuzmanovic', 'Serbia')]

*2) Find all players who made more than 20 shots. Return all player information in descending order of shots made.*

__Hint: SQL ordering syntax: "ORDER BY column1, column2, ... ASC|DESC" __

In [0]:
%%sql
select * from Players where Players.shots > 20 order by Players.shots desc

 * sqlite://
Done.

[('Gyan', 'Ghana', 'forward', 501, 27, 151, 1, 0),
 ('Villa', 'Spain', 'forward', 529, 22, 169, 2, 0),
 ('Messi', 'Argentina', 'forward', 450, 21, 321, 10, 0)]

*3) Find the goalkeepers of teams that played more than four games. List the surname of the goalkeeper, the team, and the number of minutes the goalkeeper played.*

__Hint: You should use the joined data, `PlayersExt`__

In [0]:
%%sql
select surname, team, minutes from PlayersExt 
where PlayersExt.games > 4
AND PlayersExt.position = 'goalkeeper'

 * sqlite://
Done.

[('Romero', 'Argentina', 450),
 ('Julio Cesar', 'Brazil', 450),
 ('Neuer', 'Germany', 540),
 ('Kingson', 'Ghana', 510),
 ('Stekelenburg', 'Netherlands', 540),
 ('Villar', 'Paraguay', 480),
 ('Casillas', 'Spain', 540),
 ('Muslera', 'Uruguay', 570)]

*4) How many players who play on a team with ranking <10 played more than 350 minutes? Return one number in a column named 'superstar'.*

In [0]:
%%sql
select count(*) AS superstar from PlayersExt
where PlayersExt.ranking < 10
AND PlayersExt.minutes > 350

 * sqlite://
Done.

[(54,)]

*5) What is the average number of passes made by forwards? By midfielders? Write one query that gives both values with the corresponding position.*

__Hint: use the GROUP BY clause__
__Hint: when selecting columns you can use AVG, SUM or COUNT clauses to calculate aggregates__

In [0]:
%%sql
select avg(passes), position from Players
where position = 'forward' or position = 'midfielder'
GROUP BY position

 * sqlite://
Done.

[(50.82517482517483, 'forward'), (95.2719298245614, 'midfielder')]

*6) Which team has the highest average number of passes per minute played? Return the team and average passes per minute. *

__Hint 1: You can compute a team's average number of passes per minute played by dividing the total number of passes by the total number of minutes. To force floating point division, multiply one operand by 1.0. __

__Hint 2: Consider using Limit. __

In [0]:
%%sql
select sum(passes)*1.0 / sum(minutes) AS avg_nbpasses_per_minute, team from PlayersExt
GROUP BY team
ORDER BY avg_nbpasses_per_minute desc
limit 5

 * sqlite://
Done.

[(0.6230639730639731, 'Spain'),
 (0.528080808080808, 'Argentina'),
 (0.4857026972216589, 'Brazil'),
 (0.48301053346924905, 'Germany'),
 (0.4684343434343434, 'Mexico')]

#### <font color = 'green'>World Cup Advanced Queries</font>

*1) Find all pairs of teams who have the same number of goalsFor as
each other and the same number of goalsAgainst as each other.
Return the teams and numbers of goalsFor and goalsAgainst.
Make sure to return each pair only once.*

__Hint: You basically need to do a self join of the Teams table. For that you need to join different name aliases of the Teams table. checkout [here](https://www.w3schools.com/sql/sql_join_self.asp) for help.__

In [0]:
%%sql
select A.team AS team_1, B.team AS team_2, A.goalsFor, A.goalsAgainst
from Teams A, Teams B
where A.ranking < B.ranking
AND A.goalsFor = B.goalsFor
AND A.goalsAgainst = B.goalsAgainst

 * sqlite://
Done.

[('Italy', 'Mexico', 4, 5),
 ('England', 'Chile', 3, 5),
 ('England', 'Nigeria', 3, 5),
 ('England', 'South Africa', 3, 5),
 ('Greece', 'Cameroon', 2, 5),
 ('Chile', 'Nigeria', 3, 5),
 ('Chile', 'South Africa', 3, 5),
 ('Australia', 'Denmark', 3, 6),
 ('Nigeria', 'South Africa', 3, 5)]

*2) Find all teams with ranking <30 where no player made more than 150 passes. Return the team and ranking.*

__Hint: use HAVING clause (documentation [here](https://www.w3schools.com/sql/sql_having.asp))__

In [0]:
%%sql
select team, ranking from PlayersExt
WHERE ranking < 30
GROUP BY team
HAVING max(passes) < 150

 * sqlite://
Done.

[('France', 9), ('Nigeria', 21), ('Switzerland', 24)]

*3) Which team has the highest ratio of goalsFor to goalsAgainst?*

In [0]:
%%sql
select team, goalsFor*1.0/goalsAgainst AS ratio
from Teams
ORDER BY ratio desc
limit 1

 * sqlite://
Done.

[('Portugal', 7.0)]

*4) Find all teams whose defenders averaged more than 150 passes. Return the team and average number of passes by defenders, in descending order of average passes.*

In [0]:
%%sql
select team, AVG(passes) AS avg_passes_defender
from PlayersExt
where position = 'defender'
GROUP BY team
HAVING avg_passes_defender > 150
ORDER BY avg_passes_defender desc

 * sqlite://
Done.

[('Spain', 213.0),
 ('Brazil', 190.0),
 ('Germany', 189.83333333333334),
 ('Netherlands', 182.5),
 ('Mexico', 152.14285714285714)]

### <font color = 'green'>Titanic Data</font>

In [0]:
# Load table from CSV file
with open('Titanic.csv','rU') as f:
    Titanic = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Titanic;
%sql persist Titanic

/Applications/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning: 'U' mode is deprecated

 * sqlite://
Done.
 * sqlite://

'Persisted titanic'

#### Look at sample of Titanic table

In [0]:
%%sql
select * from Titanic limit 5

 * sqlite://
Done.

[('Braund', 'Mr. Owen Harris', 'M', 22.0, 3, 7.25, 'Southampton', 'no'),
 ('Cumings', 'Mrs. John Bradley (Florence Briggs Thayer)', 'F', 38.0, 1, 71.2833, 'Cherbourg', 'yes'),
 ('Heikkinen', 'Miss Laina', 'F', 26.0, 3, 7.925, 'Southampton', 'yes'),
 ('Futrelle', 'Mrs. Jacques Heath (Lily May Peel)', 'F', 35.0, 1, 53.1, 'Southampton', 'yes'),
 ('Allen', 'Mr. William Henry', 'M', 35.0, 3, 8.05, 'Southampton', 'no')]

#### <font color = 'green'>Titanic Basic Queries</font>

*1) How many married women over age 50 embarked in Cherbourg? Note: To check if attribute A begins with string S use "A like 'S%'"*

In [0]:
%%sql
select count(*) from Titanic where Titanic.gender == 'F' 
AND Titanic.embarked like 'Cherbourg%'
AND Titanic.age > 50

 * sqlite://
Done.

[(6,)]

*2) List the average fare paid by passengers in each of the embarkation cities (along with the city), in descending order of average fare.*

In [0]:
%%sql
select AVG(fare) as avg_fare, embarked 
from Titanic
GROUP BY embarked
ORDER BY avg_fare desc

 * sqlite://
Done.

[(59.95414404761905, 'Cherbourg'),
 (27.243651393188795, 'Southampton'),
 (13.276029870129872, 'Queenstown')]

*3) What's the most common last name among passengers?*

In [0]:
%%sql
select COUNT(last) as freq, last
from Titanic
GROUP BY last 
ORDER BY freq desc
limit 1

 * sqlite://
Done.

[(9, 'Andersson')]

*4) Write three queries: the total number of passengers; the number of passengers under 30; the number of passengers 30 or older. Why do the second and third numbers not add up to the first?*

In [0]:
%%sql
select COUNT(*)
from Titanic

 * sqlite://
Done.

[(891,)]

In [0]:
%%sql
select COUNT(*)
from Titanic
where age >= 30

 * sqlite://
Done.

[(330,)]

In [0]:
%%sql
select COUNT(*)
from Titanic
where age < 30

 * sqlite://
Done.

[(384,)]

*5) Blanks in SQL tables are given a special value called 'null', and conditions 'A is null' and 'A is not null' can be used in Where clauses to check whether attribute A has the 'null' value. How many passengers don't have a value for age? Now do your numbers add up?*

In [0]:
%%sql
select COUNT(*)
from Titanic
where age is null

 * sqlite://
Done.

[(177,)]

*6) For male survivors, female survivors, male non-survivors, and female non-survivors, how many passengers were in each of those four categories and what was their average fare paid?*

In [0]:
%%sql
select gender, survived, COUNT(gender) as total, AVG(fare) as avg_fare
from Titanic
GROUP BY gender, survived

 * sqlite://
Done.

[('F', 'no', 81, 23.02438518518519),
 ('F', 'yes', 233, 51.93857339055791),
 ('M', 'no', 468, 21.960992948717944),
 ('M', 'yes', 109, 40.82148440366974)]

#### <font color = 'green'>Titanic Advanced Queries</font>

*1) Are there any pairs of passengers with the same last name where one is in first class and the other is in third class? If so, return the last name and the two first names. Label the first-name columns 'first' for the passenger in first class and 'third' for the passenger in third class.*

In [0]:
%%sql
YOUR QUERY HERE

*2) Which embarkation cities have more than 40 passengers whose age is missing? Reminder: Blanks in SQL tables are given a special value called 'null', and conditions 'A is null' and 'A is not null' can be used in Where clauses to check whether attribute A has the 'null' value.*

In [0]:
%%sql
YOUR QUERY HERE

*3) Find all classes where the average fare paid by passengers in that class was more than twice the overall average or less than half the overall average.*

In [0]:
%%sql
YOUR QUERY HERE

*4) EXTRA CREDIT CHALLENGE: List each class and its survival rate, i.e., the fraction of passengers in that class who survived.*

In [0]:
%%sql
YOUR QUERY HERE

#### <font color = 'green'>Titanic Data Modification</font>

In [0]:
# Reload table from CSV file
# NOTE: You may want to reload frequently to reset the data as you
# experiment with modifications
with open('Titanic.csv','rU') as f:
    Titanic = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql drop table if exists Titanic;
%sql persist Titanic

 * sqlite://
Done.
 * sqlite://

/Applications/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:4: DeprecationWarning: 'U' mode is deprecated
  after removing the cwd from sys.path.

'Persisted titanic'

*1) Subtract 5 from the fare paid by any passenger under the age of 10. Then compute the new average fare similar to question 2 in the previous section. NOTE: You can put two SQL statements in one cell separated by a semicolon.*

In [0]:
%%sql
UPDATE Titanic
set fare = fare - 5
where age < 10
;
select AVG(fare) as avg_fare, embarked 
from Titanic
GROUP BY embarked
ORDER BY avg_fare desc

 * sqlite://
62 rows affected.
Done.

[(59.41842976190477, 'Cherbourg'),
 (26.48513746130026, 'Southampton'),
 (12.756549350649351, 'Queenstown')]

*2) Create a new table called Survivors, containing the last and first names of all passengers who survived. Then count the number of tuples in the new table.*

__Hint: use the `CREATE TABLE` clause__

In [0]:
%%sql
drop table if exists Survivors;
CREATE TABLE Survivors AS
select first, last
from Titanic 
where survived = 'yes'
;
select COUNT(*) from Survivors

 * sqlite://
Done.
Done.
Done.

[(342,)]

*3) In the Titanic table delete all but the passengers paid more than 300.*

__Hint: use the `DELETE FROM` clause__

In [0]:
%%sql
DELETE FROM Titanic WHERE fare < 300;
select * from Titanic

 * sqlite://
888 rows affected.
Done.

[('Ward', 'Miss Anna', 'F', 35.0, 1, 512.3292, 'Cherbourg', 'yes'),
 ('Cardeza', 'Mr. Thomas Drake Martinez', 'M', 36.0, 1, 512.3292, 'Cherbourg', 'yes'),
 ('Lesurer', 'Mr. Gustave J', 'M', 35.0, 1, 512.3292, 'Cherbourg', 'yes')]

*4) In what's left of the table after (3), insert a new tuple for yourself. You can decide your class, fare, where you embarked, and whether you survived. Then show the whole table.*

__Hint: use the `INSERT INTO` clause__

In [0]:
%%sql
INSERT INTO Titanic (last, first, gender, age, class, fare, embarked, survived)
VALUES ('aj', 'ahmad', 'M', 26, 1, 300, 'geneve', 'yes');
select * from Titanic

 * sqlite://
1 rows affected.
Done.

[('Ward', 'Miss Anna', 'F', 35.0, 1, 512.3292, 'Cherbourg', 'yes'),
 ('Cardeza', 'Mr. Thomas Drake Martinez', 'M', 36.0, 1, 512.3292, 'Cherbourg', 'yes'),
 ('Lesurer', 'Mr. Gustave J', 'M', 35.0, 1, 512.3292, 'Cherbourg', 'yes'),
 ('aj', 'ahmad', 'M', 26.0, 1, 300.0, 'geneve', 'yes')]